:PROPERTIES:
:ID:       c2afa949-0d1c-4703-b69c-02ffa854d4f4
:END:
#+TITLE: Cryptography
#+DESCRIPTION: Crypto
#+TAGS:

*** Config Defaults

Use =ssh -G $host= to print the interpreted configuration for host. e.g.

#+begin_src shell :results output verbatim :wrap example diff
diff <(ssh -G te.xel.io) <(ssh -G github.com)
#+end_src

#+RESULTS:
#+begin_example diff
1,3c1,3
< host te.xel.io
< user dc
< hostname te.xel.io
---
> host github.com
> user git
> hostname github.com
56c56
< macs hmac-sha2-512-etm@openssh.com,hmac-sha2-256-etm@openssh.com
---
> macs hmac-sha2-512-etm@openssh.com,hmac-sha2-256-etm@openssh.com,umac-128-etm@openssh.com,hmac-sha2-512,hmac-sha2-256,umac-128@openssh.com
60,65c60,62
< identityfile ~/.ssh/id_rsa
< identityfile ~/.ssh/id_ecdsa
< identityfile ~/.ssh/id_ecdsa_sk
< identityfile ~/.ssh/id_ed25519
< identityfile ~/.ssh/id_ed25519_sk
< identityfile ~/.ssh/id_xmss
---
> identityfile ~/.ssh/mepubkey.pub
#+end_example

Host

#+begin_example conf
Host router
  IdentityFile router
  HostName 192.168.1.1
  Port 2222
  User sysadm
  ControlMaster auto
  ControlPath ~/.ssh/master-%r@%h:%p
  ControlPersist 300
#+end_example

~/.ssh/config.defaults

#+begin_src conf
# For now
IdentitiesOnly Yes

Host gitlab.com
  User git
  ControlMaster no
  IdentitiesOnly yes
  IdentityFile gitlab
  MACs hmac-sha2-512-etm@openssh.com,hmac-sha2-256-etm@openssh.com,umac-128-etm@openssh.com,hmac-sha2-512,hmac-sha2-256,umac-128@openssh.com
Host github.com
  User git
  ControlMaster no
  IdentitiesOnly yes
  IdentityFile github
  MACs hmac-sha2-512-etm@openssh.com,hmac-sha2-256-etm@openssh.com,umac-128-etm@openssh.com,hmac-sha2-512,hmac-sha2-256,umac-128@openssh.com

Match all
Include config.any
#+end_src

~/.ssh/config.any.defaults

#+begin_src conf :tangle (concat secrets-home "/.ssh/config.any.defaults")
Host *
  #ControlMaster auto
  #ControlPath ~/.ssh/master-%r@%h:%p
  #ControlPersist 300
  #AddKeysToAgent yes
  AddressFamily inet
  HashKnownHosts yes
  VisualHostKey yes
  PasswordAuthentication no
  ChallengeResponseAuthentication no
  StrictHostKeyChecking ask
  VerifyHostKeyDNS yes
  ForwardAgent no
  ForwardX11 no
  ForwardX11Trusted no
  ServerAliveInterval 300
  ServerAliveCountMax 2
  Ciphers chacha20-poly1305@openssh.com,aes256-gcm@openssh.com
  MACs hmac-sha2-512-etm@openssh.com,hmac-sha2-256-etm@openssh.com
  KexAlgorithms curve25519-sha256@libssh.org,diffie-hellman-group-exchange-sha256
  HostKeyAlgorithms ecdsa-sha2-nistp521-cert-v01@openssh.com,ecdsa-sha2-nistp384-cert-v01@openssh.com,ecdsa-sha2-nistp256-cert-v01@openssh.com,ssh-ed25519-cert-v01@openssh.com,ecdsa-sha2-nistp521,ecdsa-sha2-nistp384,ecdsa-sha2-nistp256,ssh-ed25519,sk-ecdsa-sha2-nistp256-cert-v01@openssh.com,sk-ecdsa-sha2-nistp256@openssh.com,rsa-sha2-512-cert-v01@openssh.com,rsa-sha2-256-cert-v01@openssh.com,rsa-sha2-512,rsa-sha2-256
  # ssh-rsa-cert-v01@openssh.com is required for github.com
#+end_src

**** Unsalt

You need the input string

#+begin_src shell :results output verbatim :var host="github.com"
sshHostsUngunk() {
    local host=$1
    shift 1
    ssh-keygen -F "$host" | grep -ve '^#' | cut -b4- | tr '|' ' '
}

b64salt=$(sshHostsUngunk $host | cut -f1 -d' ')
b64hash=$(sshHostsUngunk $host | cut -f2 -d' ')
echo $b64salt | base64 -d | wc -c
echo $b64salt
echo $b64hash | base64 -d | wc -c
echo $b64hash

cat <(echo -n $host) \
    <(sshHostsUngunk $host | cut -f1 -d' ' | base64 --decode) \
    | sha1sum | base64
#+end_src

#+RESULTS:
: 20
: g3ZQWNcEZ59VxfTbHEqzVuGkhWE=
: 20
: 5wKE/5xfM4emalPrNG8kcEedwbA=
: ZWY0MjZhNWMxOTU0Yzg0YzlkZjc0ODljNDhmZWJjY2NmZjczN2VmNiAgLQo=

#+begin_quote
hmmmm... it eats a salt and some bytes? or some bytes and then the salt? manpage
doesn't explain... although I guess I'm missing the HMAC key, but =sha1= lacks
that. is it padding or encoding or dropped bytes?
#+end_quote

